In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('Emp_Records.csv')
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,NaN,13.68,168251,NaN
1,940761,Brenda,47.02,NaN,NaN,51063,Stonewall
2,428945,Joe,54.15,68.0,0.98,50155,Michigantown
3,408351,Diane,39.67,NaN,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58.0,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60.0,28.53,95673,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650,Alma

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      100 non-null    object
 2   Age in Yrs      100 non-null    float64
 3   Weight in Kgs   97 non-null     float64
 4   Age in Company  99 non-null     float64
 5   Salary          100 non-null    int64
 6   City            99 non-null     object
dtypes: float64(3), int64(2), object(2)
memory usage: 5.6+ KB

In [5]:
df.describe()

             Emp ID  Age in Yrs  Weight in Kgs  Age in Company         Salary
count     100.00000  100.000000      97.000000       99.000000     100.000000
mean   547652.10000   39.238700      58.113402        8.978081  119738.090000
std    257664.16679   12.066252      12.460668        8.701416   46185.278194
min    134841.00000   21.100000      40.000000        0.020000   42005.000000
25%    328643.75000   28.177500      50.000000        2.045000   83979.750000
50%    497414.00000   37.595000      56.000000        5.930000  118049.500000
75%    766040.00000   49.900000      62.000000       13.845000  162509.250000
max    979607.00000   59.470000      90.000000       34.520000  197537.000000

In [6]:
df.shape

(100, 7)

In [7]:
df.size

700

In [8]:
df.isna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,True,False,False,True
1,False,False,False,True,True,False,False
2,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [9]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     3
Age in Company    1
Salary            0
City              1
dtype: int64

In [10]:
df['Weight in Kgs'].isna().sum()

3

In [11]:
df.isnull()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,True,False,False,True
1,False,False,False,True,True,False,False
2,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [12]:
df.isnull().sum()

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     3
Age in Company    1
Salary            0
City              1
dtype: int64

In [13]:
df['Age in Company'].isnull().sum()

1

In [14]:
df.mean()

C:\Users\Pranav\AppData\Local\Temp/ipykernel_60036/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Emp ID            547652.100000
Age in Yrs            39.238700
Weight in Kgs         58.113402
Age in Company         8.978081
Salary            119738.090000
dtype: float64

In [15]:
df.describe().loc['mean']

Emp ID            547652.100000
Age in Yrs            39.238700
Weight in Kgs         58.113402
Age in Company         8.978081
Salary            119738.090000
Name: mean, dtype: float64

In [16]:
df.describe().iloc[1]

Emp ID            547652.100000
Age in Yrs            39.238700
Weight in Kgs         58.113402
Age in Company         8.978081
Salary            119738.090000
Name: mean, dtype: float64

In [17]:
df['Age in Yrs'].mean()

39.23870000000001

In [18]:
np.mean(df['Age in Yrs'])

39.23870000000001

In [19]:
df['Age in Yrs'].median()

37.595

In [20]:
df.median()

C:\Users\Pranav\AppData\Local\Temp/ipykernel_60036/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Emp ID            497414.000
Age in Yrs            37.595
Weight in Kgs         56.000
Age in Company         5.930
Salary            118049.500
dtype: float64

In [21]:
import statistics as st

In [22]:
st.mode(df['Age in Yrs'])

36.36

In [23]:
df['Age in Yrs'].min()

21.1

In [24]:
np.min(df['Age in Company'])

0.02

In [25]:
df['Age in Yrs'].max()

59.47

In [26]:
np.max(df['Age in Company'])

34.52

In [27]:
df.sum()

C:\Users\Pranav\AppData\Local\Temp/ipykernel_60036/1703867807.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum()

Emp ID                                                     54765210
First Name        LoisBrendaJoeDianeBenjaminPatrickNancyCarolFra...
Age in Yrs                                                  3923.87
Weight in Kgs                                                5637.0
Age in Company                                               888.83
Salary                                                     11973809
dtype: object

In [28]:
df.Salary.sum()

11973809

In [29]:
df['Salary'].sum()

11973809

In [30]:
np.sum(df.Salary)

11973809

In [31]:
df['Salary'].count()

100

In [32]:
len(df.Salary)

100

In [33]:
np.std(df.Salary)

45953.77158255785

In [34]:
df.Salary.std()

46185.2781942548

In [35]:
np.var(df.Salary)

2111749122.661901

In [36]:
df.Salary.var()

2133079921.880708

In [37]:
np.sqrt(df.Salary)

0     410.184105
1     225.971237
2     223.953120
3     424.610410
4     342.989796
         ...
95    360.241586
96    395.213866
97    309.310524
98    225.865004
99    306.022875
Name: Salary, Length: 100, dtype: float64

In [38]:
np.cbrt(df.Salary)

0     55.205950
1     37.099561
2     36.878344
3     56.492886
4     48.999028
        ...
95    50.628598
96    53.854432
97    45.736521
98    37.087933
99    45.411857
Name: Salary, Length: 100, dtype: float64

In [39]:
np.square(df.Salary)

0     28308399001
1      2607429969
2      2515524025
3     32505926436
4     13839640164
         ...
95    16841291076
96    24396565636
97     9153322929
98     2602530225
99     8770322500
Name: Salary, Length: 100, dtype: int64

In [40]:
df.Salary**2

0     28308399001
1      2607429969
2      2515524025
3     32505926436
4     13839640164
         ...
95    16841291076
96    24396565636
97     9153322929
98     2602530225
99     8770322500
Name: Salary, Length: 100, dtype: int64